function bars() {
    return [{
        text: '第一页',
        base: '/database/page1',
        collapsed: false,
        items: [
            {text: '175. 组合两个表', link: '/175'},
            {text: '176. 第二高的薪水', link: '/176'},
            {text: '177. 第N高的薪水', link: '/177'},
            {text: '178. 分数排名', link: '/178'},
            {text: '180. 连续出现的数字', link: '/180'},
            {text: '181. 超过经理收入的员工', link: '/181'},
            {text: '182. 查找重复的电子邮箱', link: '/182'},
            {text: '183. 从不订购的客户', link: '/183'},
            {text: '183. 从不订购的客户', link: '/183'},
            {text: '185. 部门工资前三高的所有员工', link: '/185'},
            {text: '196. 删除重复的电子邮箱', link: '/196'},
            {text: '197. 上升的温度', link: '/197'},
            {text: '262. 行程和用户', link: '/262'},
            {text: '511. 游戏玩法分析 I', link: '/511'},
            {text: '550. 游戏玩法分析 IV', link: '/550'},
            {text: '570. 至少有5名直接下属的经理', link: '/570'},
            {text: '577. 员工奖金', link: '/577'},
            {text: '584. 寻找用户推荐人', link: '/584'},
            {text: '585. 2016年的投资', link: '/585'},
            {text: '586. 订单最多的客户', link: '/586'},
            {text: '595. 大的国家', link: '/595'},
            {text: '596. 超过5名学生的课', link: '/596'},
            {text: '601. 体育馆的人流量', link: '/601'},
            {text: '602. 好友申请 II ：谁有最多的好友', link: '/602'},
            {text: '607. 销售员', link: '/607'},
            {text: '608. 树节点', link: '/608'},
            {text: '610. 判断三角形', link: '/610'},
            {text: '619. 只出现一次的最大数字', link: '/619'},
            {text: '620. 有趣的电影', link: '/620'},
            {text: '626. 换座位', link: '/626'},
            {text: '627. 变更性别', link: '/627'},
            {text: '1045. 买下所有产品的客户', link: '/1045'},
            {text: '1050. 合作过至少三次的演员和导演', link: '/1050'},
            {text: '1068. 产品销售分析 I', link: '/1068'}
        ]
    }, {
        text: '第二页',
        base: '/database/page2',
        collapsed: true,
        items: [
            {text: '1070. 产品销售分析 III', link: '/1070'},
            {text: '1075. 项目员工 I', link: '/1075'},
            {text: '1084. 销售分析III', link: '/1084'},
            {text: '1141. 查询近30天活跃用户数', link: '/1141'},
            {text: '1148. 文章浏览 I', link: '/1148'},
            {text: '1158. 市场分析 I', link: '/1158'},
            {text: '1164. 指定日期的产品价格', link: '/1164'},
            {text: '1173. 即时食物配送 I', link: '/1173'},
            {text: '1174. 即时食物配送 II', link: '/1174'},
            {text: '1179. 重新格式化部门表', link: '/1179'},
            {text: '1193. 每月交易 I', link: '/1193'},
            {text: '1204. 最后一个能进入巴士的人', link: '/1204'},
            {text: '1211. 查询结果的质量和占比', link: '/1211'},
            {text: '1251. 平均售价', link: '/1251'},
            {text: '1280. 学生们参加各科测试的次数', link: '/1280'},
            {text: '1321. 餐馆营业额变化增长', link: '/1321'},
            {text: '1327. 列出指定时间段内所有的下单产品', link: '/1327'},
            {text: '1341. 电影评分', link: '/1341'}
        ]
    }, {
        text: '第三页',
        base: '/database/page3',
        collapsed: true,
        items: [
            {text: '1378. 使用唯一标识码替换员工ID', link: '/1378'},
            {text: '1393. 股票的资本损益', link: '/1393'},
            {text: '1407. 排名靠前的旅行者', link: '/1407'},
            {text: '1484. 按日期分组销售产品', link: '/1484'},
            {text: '1517. 查找拥有有效邮箱的用户', link: '/1517'},
            {text: '1527. 患某种疾病的患者', link: '/1527'},
            {text: '1581. 进店却未进行过交易的顾客', link: '/1581'},
            {text: '1587. 银行账户概要 II', link: '/1587'},
            {text: '1633. 各赛事的用户注册率', link: '/1633'},
            {text: '1661. 每台机器的进程平均运行时间', link: '/1661'},
            {text: '1667. 修复表中的名字', link: '/1667'},
            {text: '1683. 无效的推文', link: '/1683'},
            {text: '1693. 每天的领导和合伙人', link: '/1693'},
            {text: '1729. 求关注者的数量', link: '/1729'},
            {text: '1731. 每位经理的下属员工数量', link: '/1731'},
            {text: '1741. 查找每个员工花费的总时间', link: '/1741'},
            {text: '1757. 可回收且低脂的产品', link: '/1757'}
        ]
    }, {
        text: '第四页',
        base: '/database/page4',
        collapsed: true,
        items: [
            {text: '1789. 员工的直属部门', link: '/1789'},
            {text: '1795. 每个产品在不同商店的价格', link: '/1795'},
            {text: '1873. 计算特殊奖金', link: '/1873'},
            {text: '1890. 2020年最后一次登录', link: '/1890'},
            {text: '1907. 按分类统计薪水', link: '/1907'},
            {text: '1934. 确认率', link: '/1934'},
            {text: '1965. 丢失信息的雇员', link: '/1965'},
            {text: '1978. 上级经理已离职的公司员工', link: '/1978'},
            {text: '2082. 富有客户的数量', link: '/2082'}
        ]
    }, {
        text: '第五页',
        base: '/database/page5',
        collapsed: true,
        items: [
            {text: '2356. 每位教师所教授的科目种类的数量', link: '/2356'}
        ]
    }];
}

function nav() {
    return {
        text: '数据库',
        link: '/database/index',
        activeMatch: '/database/'
    };
}

export default {bars, nav}